Revit 2027 API
VertexPositionNormalColored Methods
The VertexPositionNormalColored type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from Vertex)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetColor |  Gets the vertex's color.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSizeInFloats |  Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetColor |  Sets the vertex's color.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
VertexPositionNormalColored Class
Autodesk.Revit.DB.DirectContext3D Namespace